#+TITLE: Herramientas CLI
#+AUTHOR: Miguel Angel Escalante Serrato
#+EMAIL:  miguel.escalante@itam.mx
#+DATE: 26-Oct-2020
#+LANGUAGE:  es
#+OPTIONS: num:nil toc:nil
#+REVEAL_THEME: moon
#+REVEAL_ROOT: https://cdn.jsdelivr.net/npm/reveal.js
#+REVEAL_TRANS: cube
#+REVEAL_SLIDE_NUMBER: t
#+REVEAL_HEAD_PREAMBLE: <meta name="description" content="Estadística Computacional">

** characters

#+begin_src shell
  echo "lol,lel,lil,lul,lal" | cut -c 2-10
#+end_src

#+RESULTS:
| ol | lel | li |

** Delimiter, Field.
=-d=  nos dice qué caracter usaremos para hacer los cortes, y el parámetro =-f= nos dice con qué columnas nos quedaremos.

#+begin_src shell
echo "lol,lel,lil,lul,lal" | cut -d ',' -f3
#+end_src

#+RESULTS:
: lil

#+begin_src shell
echo "lol,lel,lil,lul,lal" | cut -d ','  -f 4,5,1,2
#+end_src

#+RESULTS:
| lol | lel | lul | lal |

#+begin_src shell
echo "lol,lel,lil,lul,lal" | cut -d ','  -f 1-4
#+end_src

#+RESULTS:
| lol | lel | lil | lul |

** Complement

Nos da el complemento de las columnas que mandemos :
#+begin_src shell
echo "lol,lel,lil,lul,lal" | cut --complement  -d ',' -f 1,2,3
#+end_src

#+RESULTS:
| lul | lal |

** Output Delimiter:
#+begin_src shell
echo "lol,lel,lil,lul,lal" | cut --complement  -d ',' -f 1 --output-delimiter="@"
#+end_src

#+RESULTS:
: lel@lil@lul@lal

#+begin_src shell
  cat test.log | cut -d':' -f 3 | cut -d ';' -f 2| sort | uniq > ejercicio.log
#+end_src

** Doble o nada :P

la bandera =p= al final permite que se reimprima la línea en la cual se sustituyó el texto encontrado, ojo que si encuentra varias sustituciones sólo la repite una vez.

#+begin_src shell
  echo `wc -l kernel.log`
  sed 's/:/@HOLA@/p' < kernel.log > result.log
  echo `wc -l result.log`
#+end_src

#+RESULTS:
|  6022 | kernel.log |
| 12044 | result.log |


A menos que sólo quieras generar la impresión de sólo las que tuvieron sustitución.
#+begin_src shell
  echo `wc -l kernel.log`
  sed -n '3 s/:/@HOLA@/pg' < kernel.log > result.log
  echo `wc -l result.log`
#+end_src

#+RESULTS:
| 6022 | kernel.log |
|    1 | result.log |

** Rangos sobre las sustituciones
#+begin_src shell
  echo `wc -l kernel.log`
  sed -n '10,$ s/:/@HOLA@/p' < kernel.log > result.log
  echo `wc -l result.log`
#+end_src

#+RESULTS:
| 6022 | kernel.log |
| 6013 | result.log |

*** Podemos borrar una línea del archivo.
#+begin_src shell
  echo `wc -l kernel.log`
  sed  '1d' < kernel.log > result.log
  echo `wc -l result.log`
#+end_src

#+RESULTS:
| 6022 | kernel.log |
| 6021 | result.log |


*** O la última:
#+begin_src shell
  echo `wc -l kernel.log`
  sed  '$d' < kernel.log > result.log
  echo `wc -l result.log`
#+end_src

#+RESULTS:
| 6022 | kernel.log   |
| 6021 | result-d.log |

*** O un rango:
#+begin_src shell
  echo `wc -l kernel.log`
  sed  '1,10d' < kernel.log > result-d.log
  echo `wc -l result-d.log`
#+end_src

#+RESULTS:
| 6022 | kernel.log   |
| 6012 | result-d.log |

*** O de la n-ésima a la última:
#+begin_src shell
  echo `wc -l kernel.log`
  sed  '501,$d' < kernel.log > result-d.log
  echo `wc -l result-d.log`
#+end_src

#+RESULTS:
| 6022 | kernel.log   |
|  500 | result-d.log |

*** O borramos dado un patrón.
#+begin_src shell
  echo `wc -l kernel.log`
  sed  '/evdi/d' < kernel.log > result.log
  echo `wc -l result.log`
#+end_src

#+RESULTS:
| 6022 | kernel.log |
| 5274 | result.log |

** "."
El "." hace match con cualquier caracter.
Nos filtra todos los renglones que tienen sólo un caracter.
#+begin_src shell
grep "^.*$" kernel.log | wc -l
#+end_src

#+RESULTS:
: 6022

*** For.
#+begin_src shell
awk 'BEGIN { for (i=1; i<=10; i++) print "El cuadrado de ", i, "es",i*i;}'
#+end_src

#+RESULTS:
| El | cuadrado | de |  1 | es |   1 |
| El | cuadrado | de |  2 | es |   4 |
| El | cuadrado | de |  3 | es |   9 |
| El | cuadrado | de |  4 | es |  16 |
| El | cuadrado | de |  5 | es |  25 |
| El | cuadrado | de |  6 | es |  36 |
| El | cuadrado | de |  7 | es |  49 |
| El | cuadrado | de |  8 | es |  64 |
| El | cuadrado | de |  9 | es |  81 |
| El | cuadrado | de | 10 | es | 100 |

